CSI API ETABS v1
cOAPI.GetOAPIVersionNumber Method
 Retrieves the API version number implemented by the GUI.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
double GetOAPIVersionNumber()
Function GetOAPIVersionNumber As Double
Dim instance As cOAPI
Dim returnValue As Double
returnValue = instance.GetOAPIVersionNumber()
double GetOAPIVersionNumber()
abstract GetOAPIVersionNumber : unit -> float
Return Value
Type: Double
 Returns the API version number implemented by the GUI.
Remarks
See Also
Reference
cOAPI Interface
ETABSv1 Namespace